vvpai9/Keil/Keil_v5/ARM/Pack/.Web/SiliconLabs.GeckoPlatform_EFR32BG24_DFP.pdsc
      <subFamily DsubFamily="EFR32BG24B110">
        <book         name="Documents/efr32bg24-datasheet.pdf"      title="EFR32BG24B110 Data Sheet"/>
        <book         name="Documents/efr32bg24-errata.pdf"         title="EFR32BG24B110 Errata"/>
        <!-- *************************  Device 'EFR32BG24B110F1536IM48'  ***************************** -->
        <device Dname="EFR32BG24B110F1536IM48">
          <compile header="Device/SiliconLabs/EFR32BG24/Include/em_device.h"  define="EFR32BG24B110F1536IM48"/>
          <debug      svd="SVD/EFR32BG24/EFR32BG24B110F1536IM48.svd"/>
          <memory     id="IROM1"                start="0x00000000"  size="0x00000000"  startup="1"   default="1"/>
          <memory     id="IRAM1"                start="0x00000000"  size="0x00000000"  init   ="0"   default="1"/>
          <algorithm  name="Flash/GECKOS2C3.FLM"  start="0x00000000"  size="0x00000000"  RAMstart="0x20000000" RAMsize="0x40000" default="1" style="Keil"/>
          <algorithm  name="Flash/FlashGECKOS2C3.flash"  start="0x00000000"  size="0x00000000"  default="0"  style="IAR"/>
        </device>

      </subFamily>

      <subFamily DsubFamily="EFR32BG24B210">
        <book         name="Documents/efr32bg24-datasheet.pdf"      title="EFR32BG24B210 Data Sheet"/>
        <book         name="Documents/efr32bg24-errata.pdf"         title="EFR32BG24B210 Errata"/>
        <!-- *************************  Device 'EFR32BG24B210F1024IM48'  ***************************** -->
        <device Dname="EFR32BG24B210F1024IM48">
          <compile header="Device/SiliconLabs/EFR32BG24/Include/em_device.h"  define="EFR32BG24B210F1024IM48"/>
          <debug      svd="SVD/EFR32BG24/EFR32BG24B210F1024IM48.svd"/>
          <memory     id="IROM1"                start="0x00000000"  size="0x00000000"  startup="1"   default="1"/>
          <memory     id="IRAM1"                start="0x00000000"  size="0x00000000"  init   ="0"   default="1"/>
          <algorithm  name="Flash/GECKOS2C3.FLM"  start="0x00000000"  size="0x00000000"  RAMstart="0x20000000" RAMsize="0x40000" default="1" style="Keil"/>
          <algorithm  name="Flash/FlashGECKOS2C3.flash"  start="0x00000000"  size="0x00000000"  default="0"  style="IAR"/>
        </device>

        <!-- *************************  Device 'EFR32BG24B210F1536IM48'  ***************************** -->
        <device Dname="EFR32BG24B210F1536IM48">
          <compile header="Device/SiliconLabs/EFR32BG24/Include/em_device.h"  define="EFR32BG24B210F1536IM48"/>
          <debug      svd="SVD/EFR32BG24/EFR32BG24B210F1536IM48.svd"/>
          <memory     id="IROM1"                start="0x00000000"  size="0x00000000"  startup="1"   default="1"/>
          <memory     id="IRAM1"                start="0x00000000"  size="0x00000000"  init   ="0"   default="1"/>
          <algorithm  name="Flash/GECKOS2C3.FLM"  start="0x00000000"  size="0x00000000"  RAMstart="0x20000000" RAMsize="0x40000" default="1" style="Keil"/>
          <algorithm  name="Flash/FlashGECKOS2C3.flash"  start="0x00000000"  size="0x00000000"  default="0"  style="IAR"/>
        </device>

      </subFamily>

      <subFamily DsubFamily="EFR32BG24B220">
        <book         name="Documents/efr32bg24-datasheet.pdf"      title="EFR32BG24B220 Data Sheet"/>
        <book         name="Documents/efr32bg24-errata.pdf"         title="EFR32BG24B220 Errata"/>
        <!-- *************************  Device 'EFR32BG24B220F1024IM48'  ***************************** -->
        <device Dname="EFR32BG24B220F1024IM48">
          <compile header="Device/SiliconLabs/EFR32BG24/Include/em_device.h"  define="EFR32BG24B220F1024IM48"/>
          <debug      svd="SVD/EFR32BG24/EFR32BG24B220F1024IM48.svd"/>
          <memory     id="IROM1"                start="0x00000000"  size="0x00000000"  startup="1"   default="1"/>
          <memory     id="IRAM1"                start="0x00000000"  size="0x00000000"  init   ="0"   default="1"/>
          <algorithm  name="Flash/GECKOS2C3.FLM"  start="0x00000000"  size="0x00000000"  RAMstart="0x20000000" RAMsize="0x40000" default="1" style="Keil"/>
          <algorithm  name="Flash/FlashGECKOS2C3.flash"  start="0x00000000"  size="0x00000000"  default="0"  style="IAR"/>
        </device>

      </subFamily>

      <subFamily DsubFamily="EFR32BG24B310">
        <book         name="Documents/efr32bg24-datasheet.pdf"      title="EFR32BG24B310 Data Sheet"/>
        <book         name="Documents/efr32bg24-errata.pdf"         title="EFR32BG24B310 Errata"/>
        <!-- *************************  Device 'EFR32BG24B310F1536IJ42'  ***************************** -->
        <device Dname="EFR32BG24B310F1536IJ42">
          <compile header="Device/SiliconLabs/EFR32BG24/Include/em_device.h"  define="EFR32BG24B310F1536IJ42"/>
          <debug      svd="SVD/EFR32BG24/EFR32BG24B310F1536IJ42.svd"/>
          <memory     id="IROM1"                start="0x00000000"  size="0x00000000"  startup="1"   default="1"/>
          <memory     id="IRAM1"                start="0x00000000"  size="0x00000000"  init   ="0"   default="1"/>
          <algorithm  name="Flash/GECKOS2C3.FLM"  start="0x00000000"  size="0x00000000"  RAMstart="0x20000000" RAMsize="0x40000" default="1" style="Keil"/>
          <algorithm  name="Flash/FlashGECKOS2C3.flash"  start="0x00000000"  size="0x00000000"  default="0"  style="IAR"/>
        </device>

      </subFamily>

      <subFamily DsubFamily="EFR32BG24B410">
        <book         name="Documents/efr32bg24-datasheet.pdf"      title="EFR32BG24B410 Data Sheet"/>
        <book         name="Documents/efr32bg24-errata.pdf"         title="EFR32BG24B410 Errata"/>
        <!-- *************************  Device 'EFR32BG24B410F1536IJ42'  ***************************** -->
        <device Dname="EFR32BG24B410F1536IJ42">
          <compile header="Device/SiliconLabs/EFR32BG24/Include/em_device.h"  define="EFR32BG24B410F1536IJ42"/>
          <debug      svd="SVD/EFR32BG24/EFR32BG24B410F1536IJ42.svd"/>
          <memory     id="IROM1"                start="0x00000000"  size="0x00000000"  startup="1"   default="1"/>
          <memory     id="IRAM1"                start="0x00000000"  size="0x00000000"  init   ="0"   default="1"/>
          <algorithm  name="Flash/GECKOS2C3.FLM"  start="0x00000000"  size="0x00000000"  RAMstart="0x20000000" RAMsize="0x40000" default="1" style="Keil"/>
          <algorithm  name="Flash/FlashGECKOS2C3.flash"  start="0x00000000"  size="0x00000000"  default="0"  style="IAR"/>
        </device>

      </subFamily>

