vvpai9/Keil/Keil_v5/ARM/Pack/.Web/SiliconLabs.GeckoPlatform_EFR32BG24_DFP.pdsc
      <subFamily DsubFamily="EFR32BG24B610">
        <book         name="Documents/efr32bg24-datasheet.pdf"      title="EFR32BG24B610 Data Sheet"/>
        <book         name="Documents/efr32bg24-errata.pdf"         title="EFR32BG24B610 Errata"/>
        <!-- *************************  Device 'EFR32BG24B610F1536IM40'  ***************************** -->
        <device Dname="EFR32BG24B610F1536IM40">
          <compile header="Device/SiliconLabs/EFR32BG24/Include/em_device.h"  define="EFR32BG24B610F1536IM40"/>
          <debug      svd="SVD/EFR32BG24/EFR32BG24B610F1536IM40.svd"/>
          <memory     id="IROM1"                start="0x00000000"  size="0x00000000"  startup="1"   default="1"/>
          <memory     id="IRAM1"                start="0x00000000"  size="0x00000000"  init   ="0"   default="1"/>
          <algorithm  name="Flash/GECKOS2C3.FLM"  start="0x00000000"  size="0x00000000"  RAMstart="0x20000000" RAMsize="0x40000" default="1" style="Keil"/>
          <algorithm  name="Flash/FlashGECKOS2C3.flash"  start="0x00000000"  size="0x00000000"  default="0"  style="IAR"/>
        </device>

      </subFamily>

      <subFamily DsubFamily="EFR32BG24B620">
        <book         name="Documents/efr32bg24-datasheet.pdf"      title="EFR32BG24B620 Data Sheet"/>
        <book         name="Documents/efr32bg24-errata.pdf"         title="EFR32BG24B620 Errata"/>
        <!-- *************************  Device 'EFR32BG24B620F1536IM40'  ***************************** -->
        <device Dname="EFR32BG24B620F1536IM40">
          <compile header="Device/SiliconLabs/EFR32BG24/Include/em_device.h"  define="EFR32BG24B620F1536IM40"/>
          <debug      svd="SVD/EFR32BG24/EFR32BG24B620F1536IM40.svd"/>
          <memory     id="IROM1"                start="0x00000000"  size="0x00000000"  startup="1"   default="1"/>
          <memory     id="IRAM1"                start="0x00000000"  size="0x00000000"  init   ="0"   default="1"/>
          <algorithm  name="Flash/GECKOS2C3.FLM"  start="0x00000000"  size="0x00000000"  RAMstart="0x20000000" RAMsize="0x40000" default="1" style="Keil"/>
          <algorithm  name="Flash/FlashGECKOS2C3.flash"  start="0x00000000"  size="0x00000000"  default="0"  style="IAR"/>
        </device>

      </subFamily>

      <subFamily DsubFamily="EFR32BG24L010">
        <book         name="Documents/efr32bg24-datasheet.pdf"      title="EFR32BG24L010 Data Sheet"/>
        <book         name="Documents/efr32bg24-errata.pdf"         title="EFR32BG24L010 Errata"/>
        <!-- *************************  Device 'EFR32BG24L010F768IM40'  ***************************** -->
        <device Dname="EFR32BG24L010F768IM40">
          <compile header="Device/SiliconLabs/EFR32BG24/Include/em_device.h"  define="EFR32BG24L010F768IM40"/>
          <debug      svd="SVD/EFR32BG24/EFR32BG24L010F768IM40.svd"/>
          <memory     id="IROM1"                start="0x00000000"  size="0x00000000"  startup="1"   default="1"/>
          <memory     id="IRAM1"                start="0x00000000"  size="0x00000000"  init   ="0"   default="1"/>
          <algorithm  name="Flash/GECKOS2C3.FLM"  start="0x00000000"  size="0x00000000"  RAMstart="0x20000000" RAMsize="0x40000" default="1" style="Keil"/>
          <algorithm  name="Flash/FlashGECKOS2C3.flash"  start="0x00000000"  size="0x00000000"  default="0"  style="IAR"/>
        </device>

      </subFamily>

      <subFamily DsubFamily="EFR32BG24L210">
        <book         name="Documents/efr32bg24-datasheet.pdf"      title="EFR32BG24L210 Data Sheet"/>
        <book         name="Documents/efr32bg24-errata.pdf"         title="EFR32BG24L210 Errata"/>
        <!-- *************************  Device 'EFR32BG24L210F768IM40'  ***************************** -->
        <device Dname="EFR32BG24L210F768IM40">
          <compile header="Device/SiliconLabs/EFR32BG24/Include/em_device.h"  define="EFR32BG24L210F768IM40"/>
          <debug      svd="SVD/EFR32BG24/EFR32BG24L210F768IM40.svd"/>
          <memory     id="IROM1"                start="0x00000000"  size="0x00000000"  startup="1"   default="1"/>
          <memory     id="IRAM1"                start="0x00000000"  size="0x00000000"  init   ="0"   default="1"/>
          <algorithm  name="Flash/GECKOS2C3.FLM"  start="0x00000000"  size="0x00000000"  RAMstart="0x20000000" RAMsize="0x40000" default="1" style="Keil"/>
          <algorithm  name="Flash/FlashGECKOS2C3.flash"  start="0x00000000"  size="0x00000000"  default="0"  style="IAR"/>
        </device>

      </subFamily>

    </family>
  </devices>

  <conditions>
    <!-- Compiler Conditions -->
    <condition id="Compiler GCC">
      <require Tcompiler="GCC"/>
    </condition>
    <condition id="Compiler IAR">
      <require Tcompiler="IAR"/>
    </condition>

    <!-- Device Conditions -->
    <condition id="EFR32BG24">
      <description>Silicon Labs EFR32BG24 device series</description>
      <require Dvendor="Silicon Labs:21" Dname="EFR32BG24*"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
  </conditions>

  <components>
    <component Cclass="Device" Cgroup="Startup" Cversion="2025.6.2" condition="EFR32BG24">
      <description>System Startup for Silicon Labs EFR32BG24 device series</description>
      <files>
        <!-- include folder -->
        <file category="include" name="Device/SiliconLabs/EFR32BG24/Include/"/>
        <file category="header"  name="Device/SiliconLabs/EFR32BG24/Include/em_device.h"/>
        <!-- system file -->
        <file category="source"  name="Device/SiliconLabs/EFR32BG24/Source/system_efr32bg24.c" attr="config" version="2025.6.2"/>
      </files>
    </component>
  </components>
</package>
